src/InformationRegisters/Scan_ЛичныеКомментарииПользователей/Scan_ЛичныеКомментарииПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_ЛичныеКомментарииПользователей</name>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказНаЗавод</name>
    <type>
      <types>CatalogRef.Scan_ЗаказыНаЗавод</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/Scan_ЛичныеКомментарииПользователей/ManagerModule.bsl
// Функция записи параметров в регистр сведений
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи – пользователь, который пишет комментарий
//	ЗаказНаЗавод - СправочникСсылка.Scan_ЗаказыНаЗавод - Заказ на завод, в котором указывается комментарий
// Возвращаемое значение:
//   Булево   – ошибка записи значения
Функция ЗаписьЗначенияРегистраСведения(Пользователь, ЗаказНаЗавод, Комментарий) Экспорт  //rarus  04.03.2020 0015725 +-
	
	Отказ = Ложь;
	Если НЕ ЗначениеЗаполнено(Пользователь) ИЛИ НЕ ЗначениеЗаполнено(ЗаказНаЗавод) ИЛИ НЕ ЗначениеЗаполнено(Комментарий) Тогда
		Отказ = Истина;
		Возврат Отказ;
	КонецЕсли;
		
	МенеджерЗаписи = РегистрыСведений.Scan_ЛичныеКомментарииПользователей.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Пользователь	= Пользователь;
	МенеджерЗаписи.ЗаказНаЗавод	= ЗаказНаЗавод;
	МенеджерЗаписи.Комментарий	= Комментарий;
	
	Попытка
		МенеджерЗаписи.Записать();  
	Исключение
		Сообщить(ОписаниеОшибки());
		Отказ = Истина;
	КонецПопытки; 
		
	Возврат Отказ;
КонецФункции

Функция ПолучитьКомментарий(Пользователь, ЗаказНаЗавод) Экспорт //rarus  04.03.2020 0015725 +-
	МенеджерЗаписи = РегистрыСведений.Scan_ЛичныеКомментарииПользователей.СоздатьМенеджерЗаписи();	
	
	МенеджерЗаписи.ЗаказНаЗавод = ЗаказНаЗавод;
	МенеджерЗаписи.Пользователь = Пользователь;
	МенеджерЗаписи.Прочитать();
	
	Возврат МенеджерЗаписи.Комментарий;	
КонецФункции
